{
  "peft_type": "LORA",
  "task_type": "CAUSAL_LM",
  "model_id": "meta-llama/Llama-3.2-1B",
  "lora_config": {
    "r": 16,
    "lora_alpha": 32,
    "lora_dropout": 0.05,
    "bias": "none",
    "target_modules": [
      "q_proj",
      "k_proj",
      "v_proj",
      "o_proj",
      "gate_proj",
      "up_proj",
      "down_proj"
    ]
  },
  "training_args": {
    "learning_rate": 0.0002,
    "num_train_epochs": 3,
    "per_device_train_batch_size": 8,
    "gradient_accumulation_steps": 4,
    "gradient_checkpointing": true,
    "warmup_ratio": 0.03,
    "weight_decay": 0.01,
    "fp16": true,
    "max_grad_norm": 0.3
  }
}