{
  "peft_type": "LORA",
  "task_type": "CAUSAL_LM",
  "model_id": "meta-llama/Llama-3.2-1B",
  "lora_config": {
    "r": 16,
    "lora_alpha": 32,
    "lora_dropout": 0.05,
    "bias": "none",
    "target_modules": [
      "q_proj",
      "k_proj",
      "v_proj",
      "o_proj",
      "gate_proj",
      "up_proj",
      "down_proj"
    ]
  },
  "training_args": {
    "learning_rate": 0.0003,
    "num_train_epochs": 5,
    "per_device_train_batch_size": 4,
    "gradient_accumulation_steps": 2,
    "gradient_checkpointing": true,
    "warmup_ratio": 0.05,
    "weight_decay": 0.005,
    "fp16": true,
    "max_grad_norm": 0.3
  },
  "persona_config": {
    "enable_style_adaptation": true,
    "use_prefix_tuning": true,
    "prefix_length": 8,
    "preserve_writing_style": true
  }
}